In [1]:
import pandas as pd
import seaborn as sns
import matplotlib.pyplot as plt
from sklearn.model_selection import train_test_split

In [2]:
dataset = pd.read_csv("../csvs/Salary_Data.csv")
dataset.head(5)

,Age,Gender,Education Level,Job Title,Years of Experience,Salary
0,32.0,Male,Bachelor's,Software Engineer,5.0,90000.0
1,28.0,Female,Master's,Data Analyst,3.0,65000.0
2,45.0,Male,PhD,Senior Manager,15.0,150000.0
3,36.0,Female,Bachelor's,Sales Associate,7.0,60000.0
4,52.0,Male,Master's,Director,20.0,200000.0

In [7]:
dataset.isnull().sum()

Age                    0
Gender                 2
Education Level        3
Job Title              2
Years of Experience    0
Salary                 0
dtype: int64

In [6]:
dataset["Age"].fillna(dataset["Age"].mean, inplace=True)
dataset["Years of Experience"].fillna(dataset["Years of Experience"].mean, inplace=True)
dataset["Salary"].fillna(dataset["Salary"].mean, inplace=True)

C:\Users\Hp\AppData\Local\Temp\ipykernel_12940\363539293.py:2: FutureWarning: Setting an item of incompatible dtype is deprecated and will raise an error in a future version of pandas. Value '<bound method Series.mean of 0        5.0
1        3.0
2       15.0
3        7.0
4       20.0
        ...
6699    20.0
6700     3.0
6701     4.0
6702    14.0
6703     1.0
Name: Years of Experience, Length: 6704, dtype: float64>' has dtype incompatible with float64, please explicitly cast to a compatible dtype first.
  dataset["Years of Experience"].fillna(dataset["Years of Experience"].mean, inplace=True)
C:\Users\Hp\AppData\Local\Temp\ipykernel_12940\363539293.py:3: FutureWarning: Setting an item of incompatible dtype is deprecated and will raise an error in a future version of pandas. Value '<bound method Series.mean of 0        90000.0
1        65000.0
2       150000.0
3        60000.0
4       200000.0
          ...
6699    200000.0
6700     50000.0
6701     55000.0
6702    140000.0
6703     35000.0
Name: Salary, Length: 6704, dtype: float64>' has dtype incompatible with float64, please explicitly cast to a compatible dtype first.
  dataset["Salary"].fillna(dataset["Salary"].mean, inplace=True)

In [25]:
# dataset.drop(columns=['Education Level', 'Job Title'] , inplace=True)
dataset.drop(columns=['Gender'] , inplace=True)

dataset

       Age Years of Experience    Salary
0     32.0                 5.0   90000.0
1     28.0                 3.0   65000.0
2     45.0                15.0  150000.0
3     36.0                 7.0   60000.0
4     52.0                20.0  200000.0
...    ...                 ...       ...
6699  49.0                20.0  200000.0
6700  32.0                 3.0   50000.0
6701  30.0                 4.0   55000.0
6702  46.0                14.0  140000.0
6703  26.0                 1.0   35000.0

[6704 rows x 3 columns]

In [33]:
dataset.info()
numeric_data = dataset.select_dtypes(include=['number'])

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6704 entries, 0 to 6703
Data columns (total 3 columns):
 #   Column               Non-Null Count  Dtype
---  ------               --------------  -----
 0   Age                  6704 non-null   object
 1   Years of Experience  6704 non-null   object
 2   Salary               6704 non-null   object
dtypes: object(3)
memory usage: 157.3+ KB

In [37]:
sns.pairplot(data= dataset)
type(dataset)

ValueError: No variables found for grid columns.